Yu-Ting-Sun/yiki-m55m1/main.cpp
static bool SlideFilter_IsLocked(void)
{
    if (s_locked && (GetSystemTick_ms() - s_lockedAtMs) >= LOCK_HOLD_MS)
    {
        s_locked      = false;
        s_candHits    = 0;
        s_candUser[0] = '\0';
        s_lastSeenMs  = GetSystemTick_ms();   /* start the re-check window */
        printf("[LOCK] re-checking after %u ms — recognition back on\n",
               (unsigned)LOCK_HOLD_MS);
    }

    return s_locked;
}

/* Manual unlock (button): bring the timed re-check forward to now. The
 * filter stays applied meanwhile, so recognising the same person again is
 * seamless and only a real absence falls back to everything. */
static void SlideFilter_Unlock(void)
{
    if (!s_locked)
        return;

    s_locked      = false;
    s_candUser[0] = '\0';
    s_candHits    = 0;
    s_lastSeenMs  = GetSystemTick_ms();
    printf("[LOCK] released by button — re-checking now\n");
}

/* Called once per captured camera frame with the recognised label, or NULL
 * when nobody was recognised this frame (no face, unknown face, or recog
 * unavailable). Only called while unlocked. */
static void SlideFilter_Update(const char *label)
{
    if (label != NULL)
    {
        s_lastSeenMs = GetSystemTick_ms();

        if (strncmp(label, s_candUser, sizeof(s_candUser)) != 0)
        {
            strncpy(s_candUser, label, sizeof(s_candUser) - 1);
            s_candUser[sizeof(s_candUser) - 1] = '\0';
            s_candHits = 1;
        }
        else if (s_candHits < FILTER_SWITCH_HITS)
            s_candHits++;

        if (s_candHits >= FILTER_SWITCH_HITS)
        {
            if (strncmp(s_candUser, s_filterUser, sizeof(s_filterUser)) != 0)
            {
                strcpy(s_filterUser, s_candUser);
                int n = Slideshow_SetFilter(s_filterUser);
                printf("[FILTER] -> '%s' (%d album(s))\n", s_filterUser, n);
            }

            s_locked     = true;
            s_lockedAtMs = GetSystemTick_ms();
            printf("[LOCK] holding '%s' for %u ms — recognition paused\n",
                   s_filterUser, (unsigned)LOCK_HOLD_MS);
        }
    }
    else if (s_filterUser[0] != '\0' &&
             (GetSystemTick_ms() - s_lastSeenMs) > FILTER_CLEAR_MS)
    {
        s_filterUser[0]  = '\0';
        s_candUser[0] = '\0';
        s_candHits    = 0;
        Slideshow_SetFilter(NULL);
        printf("[FILTER] -> all (nobody recognised for %u ms)\n",
               (unsigned)FILTER_CLEAR_MS);
    }
}
#endif /* RUN_FACE_RECOG && !RUN_FACE_ENROLL */

#if RUN_GESTURE_LIKE
/*----------------------------------------------------------------------------
 * Phase-6: debounced thumbs-up -> one like report to the backend.
 * LIKE_CONFIRM_HITS consecutive gesture frames confirm (kills single-frame
 * false positives); then LIKE_COOLDOWN_MS of silence so one held gesture
 * produces exactly one like.
 *--------------------------------------------------------------------------*/
static void LikeGesture_Update(int seen)
{
    static int      hits       = 0;
    static uint32_t lastFireMs = 0;

    if (seen <= 0)
    {
        hits = 0;
        return;
    }

    uint32_t now = GetSystemTick_ms();
    if (lastFireMs != 0 && (now - lastFireMs) < LIKE_COOLDOWN_MS)
        return;                          /* cooling down */
    if (++hits < LIKE_CONFIRM_HITS)
        return;

    hits       = 0;
    lastFireMs = now;

    char folder[64], photo[64];
    Slideshow_GetCurrent(folder, sizeof(folder), photo, sizeof(photo));

#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
    const char *user = s_filterUser;
#else
    const char *user = "";
#endif

    printf("[LIKE] thumbs-up confirmed: %s/%s by '%s'\n",
           folder, photo, user[0] ? user : "(unknown)");

    /* Rail feedback reflects the actual delivery (POST is ~0.3 s). */
    if (SdSync_PostLike(folder, photo, user) == 0)
        StoryUI_ShowStatus("Like sent <3");
    else
        StoryUI_ShowStatus("Like failed :(");
}
#endif /* RUN_GESTURE_LIKE */

/*----------------------------------------------------------------------------
 * main
 *--------------------------------------------------------------------------*/
int main(void)
{
    BoardInit();          /* clocks, UART, HyperRAM map, SD mount, NPU init */

#if RUN_ESP_PROBE
    /* Must run before PerfTimer_Init(): the probe owns SysTick for delays. */
    esp_probe_run();      /* never returns */
#endif

    /* NOTE: no DWT register is read here anymore - touching DWT/CoreSight
     * without a live debug session hangs this board (standalone-reset bug). */
    if (PerfTimer_Init())             /* timing source: DWT, else SysTick */
        printf("[OK] timing source: DWT CYCCNT (cycle-accurate)\n");
    else
        printf("[OK] timing source: SysTick 64-bit (DWT disabled - see PerfTimer.h)\n");

#if RUN_DAY2_TESTS
    day2_test_run();      /* Wi-Fi + HTTP link validation; never returns */
#endif

#if RUN_DAY3_DEMO
    /* Day-3 demo: story rail + photo slideshow side by side. */
    if (Display_Init() == 0)
    {
        int d3 = day3_demo_run();
        if (d3 != 0)
            printf_err("Day-3 story failed (rc=%d) - running photos only\n", d3);

#if RUN_SD_SYNC
        /* Boot sync BEFORE the library scan and photo enrollment, so albums
         * and enroll files pushed from the App are picked up this boot. */
        if (SdSync_Boot() > 0)
            printf("[MAIN] SD content updated from backend\n");
#endif

        Slideshow_ReserveRight(STORYUI_RESERVED_PX);
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);

        int slrc;

        if (Slideshow_LibScan(SLIDESHOW_DIR) < 0)
            slrc = -1;
        else
        {
#if RUN_CAMERA_PREVIEW
            /* Preview sits in the bottom-right corner of the photo region.
             * No camera (init fail) degrades to the plain slideshow. */
            bool     camOk = (Camera_Init() == 0);
#if SHOW_CAMERA_PREVIEW
            uint32_t camX  = Disaplay_GetLCDWidth() - STORYUI_RESERVED_PX - CAM_W;
            uint32_t camY  = Disaplay_GetLCDHeight() - CAM_H;
#endif
#if RUN_FACE_DETECT
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
#if SHOW_CAMERA_PREVIEW
            /* Set once when the lock wipes the preview corner, so the wipe
             * happens on the lock edge and not on every idle tick. */
            bool previewCleared = false;
#endif
#if RUN_UNLOCK_BUTTON
            Button_Init();      /* manual unlock while locked */
#endif
#endif
            /* Face detection draws boxes onto the frame before it is blitted.
             * Init failure degrades to plain preview (no boxes). */
            bool fdOk = camOk && (FaceDetect_Init() == 0);
#if RUN_FACE_RECOG
            bool frOk = fdOk && (FaceRecog_Init() == 0);
#endif
#if RUN_GESTURE_LIKE
            /* Hand-landmark model + arena live at fixed HyperRAM addresses
             * (MemoryLayout.h demo plan). The linker knows nothing about
             * them, so first verify its SRAM01_HYPERRAM spill still ends
             * below the shrunken front guard. */
            bool glOk = false;
            {
                extern char Image$$SRAM01_HYPERRAM$$ZI$$Limit[];
                uint32_t spillEnd =
                    (uint32_t)(uintptr_t)Image$$SRAM01_HYPERRAM$$ZI$$Limit;

                if (spillEnd > DEMO_GUARD_END)
                {
                    /* printf_err is a two-statement macro — keep the braces */
                    printf_err("[GESTURE] arena spill 0x%08X exceeds guard "
                               "0x%08X - like feature disabled\n",
                               (unsigned)spillEnd, (unsigned)DEMO_GUARD_END);
                }
                else
                    glOk = camOk && (GestureLike_Init() == 0);
            }
#endif
#if RUN_FACE_ENROLL
            int  enrollSeen = 0;
#endif
            /* Single combined arena MPU setup (cacheable WTRA): the BSP
             * configures all app MPU regions in ONE InitPreDefMPURegion call,
             * so both arenas are set together here rather than per module. */
            if (fdOk
#if RUN_GESTURE_LIKE
                || glOk
#endif
               )
            {
                ARM_MPU_Region_t rg[3];
                uint32_t nrg = 0;
                void    *aBase; uint32_t aSize;

                if (fdOk)
                {
                    FaceDetect_GetArena(&aBase, &aSize);
                    rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                    rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                    nrg++;
#if RUN_FACE_RECOG
                    if (frOk)
                    {
                        FaceRecog_GetArena(&aBase, &aSize);
                        rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                        rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                        nrg++;
                    }
#endif
                }
#if RUN_GESTURE_LIKE
                /* HyperRAM arena gets the same WTRA policy the Day-1 spilled
                 * arena ran with (write-through so the NPU sees CPU-written
                 * inputs; the ethosu cache hooks handle the way back). */
                if (glOk)
                {
                    GestureLike_GetArena(&aBase, &aSize);
                    rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                    rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                    nrg++;
                }
#endif
                InitPreDefMPURegion(&rg[0], nrg);
            }

