Yu-Ting-Sun/yiki-m55m1/main.cpp
#if RUN_PHOTO_ENROLL && RUN_FACE_RECOG && !RUN_FACE_ENROLL
            /* Photo enrollment: scan 0:\faces for enroll_<label>.raw files,
             * run each through the identical detect/crop/embed pipeline as
             * if it were a camera frame, enroll, then rename it *.done.
             * (Names are collected first — renaming while f_readdir walks
             * the directory could disturb the iteration.) */
            if (fdOk && frOk)
            {
                static char names[PHOTO_ENROLL_MAX][40];
                int     nFound = 0;
                DIR     dj;
                FILINFO fno;

                if (f_opendir(&dj, "0:\\faces") == FR_OK)
                {
                    while (nFound < PHOTO_ENROLL_MAX &&
                           f_readdir(&dj, &fno) == FR_OK && fno.fname[0])
                    {
                        size_t n = strlen(fno.fname);
                        if (n >= sizeof(names[0]) ||
                            n < 12 ||                       /* enroll_x.raw */
                            strncmp(fno.fname, "enroll_", 7) != 0 ||
                            strcmp(&fno.fname[n - 4], ".raw") != 0)
                            continue;
                        strcpy(names[nFound++], fno.fname);
                    }
                    f_closedir(&dj);
                }

                for (int pi = 0; pi < nFound; pi++)
                {
                    char   label[24], rawPath[56], donePath[56];
                    size_t ll = strlen(names[pi]) - 7 - 4;
                    if (ll >= sizeof(label)) continue;
                    memcpy(label, &names[pi][7], ll);
                    label[ll] = '\0';

                    /* enroll_user1-2.raw -> user1 (extra reference photos) */
                    char *dash = strrchr(label, '-');
                    if (dash && dash[1])
                    {
                        bool digits = true;
                        for (char *p = dash + 1; *p; p++)
                            if (*p < '0' || *p > '9') digits = false;
                        if (digits) *dash = '\0';
                    }

                    snprintf(rawPath,  sizeof(rawPath),  "0:\\faces\\%s", names[pi]);
                    snprintf(donePath, sizeof(donePath), "0:\\faces\\%s", names[pi]);
                    memcpy(&donePath[strlen(donePath) - 4], ".done", 6);

                    FIL pf;
                    if (f_open(&pf, rawPath, FA_READ) != FR_OK)
                        continue;

                    uint16_t *frame = (uint16_t *)Camera_GetFrame();
                    UINT      br    = 0;
                    FRESULT   fr2   = f_read(&pf, frame, CAM_W * CAM_H * 2, &br);
                    f_close(&pf);

                    if (fr2 == FR_OK && br == CAM_W * CAM_H * 2)
                    {
                        FaceBox tb;
                        if (FaceDetect_Run(frame, CAM_W, CAM_H) > 0 &&
                            FaceDetect_GetTopBox(&tb))
                        {
                            if (FaceRecog_Enroll(frame, CAM_W, CAM_H, &tb,
                                                 label) == 0)
                            {
                                f_unlink(donePath);
                                f_rename(rawPath, donePath);
                                printf("[PHOTO-ENROLL] '%s' enrolled from %s\n",
                                       label, rawPath);
                            }
                        }
                        else
                            printf("[PHOTO-ENROLL] no face detected in %s\n",
                                   rawPath);

#if SHOW_CAMERA_PREVIEW
                        Camera_Blit(camX, camY);   /* show photo + box briefly */
#endif
                    }
                    else
                        printf("[PHOTO-ENROLL] bad size in %s: read %u, want %u\n",
                               rawPath, (unsigned)br, (unsigned)(CAM_W * CAM_H * 2));
                }
            }
#endif
#endif
#endif

            for (;;)
            {
                slrc = Slideshow_ShowNext();
                if (slrc != 0) break;

#if RUN_SD_SYNC
                /* Doorbell between photos: a tiny /pending GET; the actual
                 * download runs only when the App pressed 「立即同步」. On
                 * fresh content, rescan so it enters the rotation now. */
                {
                    static uint32_t s_lastCheckMs = 0;
                    uint32_t now = GetSystemTick_ms();

                    if (now - s_lastCheckMs >= SDSYNC_CHECK_MS)
                    {
                        s_lastCheckMs = now;
                        if (SdSync_Poll() > 0)
                        {
                            Slideshow_LibScan(SLIDESHOW_DIR);
                            continue;           /* show the new content now */
                        }
                    }
                }
#endif

                /* Hold window: this idle time is where the camera (and later
                 * the face-recognition inference) runs. */
                uint32_t t0 = GetSystemTick_ms();

                while ((GetSystemTick_ms() - t0) < SLIDESHOW_HOLD_MS)
                {
#if RUN_CAMERA_PREVIEW
                    /* Locked onto a viewer: face recognition pauses (the box
                     * stops flickering red/green) and the preview corner is
                     * wiped once, leaving a clean photo frame. Capture and the
                     * like gesture deliberately keep running — being locked is
                     * exactly when somebody is standing in front of the frame,
                     * ready to thumbs-up the photo. */
                    bool locked = false;
#if RUN_FACE_DETECT && RUN_FACE_RECOG && !RUN_FACE_ENROLL
                    locked = SlideFilter_IsLocked();

                    if (locked)
                    {
#if RUN_UNLOCK_BUTTON
                        if (Button_Pressed())
                            SlideFilter_Unlock();
#endif
#if SHOW_CAMERA_PREVIEW
                        if (!previewCleared)
                        {
                            S_DISP_RECT r = { camX, camY,
                                              camX + CAM_W - 1, camY + CAM_H - 1 };
                            Display_ClearRect(C_BLACK, &r);
                            previewCleared = true;
                        }
#endif
                    }
#if SHOW_CAMERA_PREVIEW
                    else
                        previewCleared = false;
#endif
#if !RUN_GESTURE_LIKE
                    /* Without the like gesture nothing else needs the camera
                     * while locked, so idle cheaply (the PR's behaviour). */
                    if (locked)
                    {
                        Display_Delay(50);
                        continue;
                    }
#endif
#endif
                    (void)locked;
                    if (camOk)
                    {
                        if (Camera_Capture() != 0)
                        {
                            camOk = false;      /* capture died: stop trying */
                            continue;
                        }

